---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterIterator.IsDone
source: html/5b5eca12-3510-a86b-e8ef-e76c20b4f01d.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.